# ==========================================
# โจทย์ข้อที่ 4: คำนวณค่าจัดส่งสินค้าตามน้ำหนัก
# Input: น้ำหนักสินค้า kg (จำนวนจริงหรือจำนวนเต็ม)
# Output: ค่าจัดส่ง (30, 50 หรือ 100)
# เงื่อนไข: น้ำหนัก <= 1 kg จ่าย 30 | น้ำหนัก <= 5 kg จ่าย 50 | เกิน 5 kg จ่าย 100
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
weight = float(input("น้ำหนักสินค้า : "))
if weight <= 1:
    print("ค่าจัดส่งสิค้า = 30 บาท")
elif weight <= 5:
    print("ค่าจัดส่งสินค้า = 50 บาท")
else:
    print("ค่าจัดส่งสินค้า = 100 บาท")
